task4/Case folder/Re50/Re50_2000_160/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0]; // pressure/density --> m^2/s^2

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type           zeroGradient;
    }

   outlet
    {
        type            fixedValue; //changed
        value			uniform 0; //changed
	
    }
    
    top
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }

    cylinder
    {
        type            zeroGradient;
    }
    sides
    {
		type 			empty;
	}
	
}

// ************************************************************************* //
