task4/Case folder/Re50/Re50_2000_160/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         600;

deltaT          0.05;

writeControl    adjustableRunTime;

writeInterval   10;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable no;

adjustTimeStep  no;

maxCo           1;

functions
{
PressureProbes 
{ 
	type            probes; 
	//functionObjectLibs (“libsampling.so”); 
	outputControl   timeStep; 
	outputInterval  1; 
	probeLocations 
	( 
		(-0.025 0 0)
		( 0.025 0 0 ) 
		( 0.04 0 0 ) 
	); 
	fields 
	( 
		p 
	); 
} 
forces  //plots the forces
{
	type			forces;
	functionObjectLibs	("libforces.so");
	outputControl		timeStep;
	outputInterval		5;
	
	patches			("cylinder");
	pName			p;
	UName			U;
	rhoName			rhoInf;
	log			true;
	CofR			(0 0 0);	
	rhoInf			1.225;
	
}
forceCoeffs
{
	type			forceCoeffs;
	functionObjectLibs	("libforces.so");
	outputControl		timeStep;
	outputInterval		10;
	
	patches			("cylinder");
	pName			p;
	UName			U;
	rhoName			rhoInf;
	log			true;
	
	liftDir			(0 1 0);
	dragDir			(1 0 0);
	CofR			(0 0 0);
	pitchAxis		(0 0 1);
	
	magUInf			0.0015625;  //check
	rhoInf			1.225; //check
	lRef			0.04;  //check
	Aref			0.0004;  //check
}

wallShearStress1
    {
        type        wallShearStress;
        functionObjectLibs ("libutilityFunctionObjects.so");
        patches     ("cylinder");
//        outputControl   timeStep;
        outputControl   runTime;
        writeInterval   50;
    }

}
